app/views/notifications/_notification.html.haml

SELECT  "users".* FROM "users"  WHERE "users"."type" IN ('Coach') AND "users"."id" = $1 LIMIT 1  [["id", 3]]
---
  - when "FavoriteSchool"
    %li= link_to "Your school was favorited by #{notification.notifieable.player.first_name}.", notification.notifieable.user