app/views/users/_coach_home.html.haml

SELECT "position_needs".* FROM "position_needs"  WHERE "position_needs"."coach_id" = $1
---
                  %strong Needs:
                  - @user.position_needs.each do |need|

SELECT COUNT(*) FROM "position_needs"  WHERE "position_needs"."coach_id" = $1
---
                %h2
                  %strong= @user.position_needs.count

SELECT  1 AS one FROM "notifications"  WHERE "notifications"."user_id" = $1 LIMIT 1  [["user_id", 3]]
SELECT "notifications".* FROM "notifications"  WHERE "notifications"."user_id" = $1  [["user_id", 3]]
---
      %div.modal-body
        - if @user.notifications.empty?