app/views/users/_form.html.haml

SELECT "positions".* FROM "positions"
---
    What positions do you play?
    = select_tag "positions[]", options_from_collection_for_select(Position.all.collect, "id", "name"), multiple: true, class: "form-control"

SELECT "schools".* FROM "schools"
---
    At what school do you coach?
    = select_tag "school", options_from_collection_for_select(School.all.collect, "id", "name"), class: "form-control"
.form-group