app/views/users/_player_home.html.haml

SELECT "positions".* FROM "positions" INNER JOIN "players_positions" ON "positions"."id" = "players_positions"."position_id" WHERE "players_positions"."player_id" = $1
---
                  %strong Positions:
                  - @user.positions.each do |pos|

SELECT COUNT(*) FROM "notifications"  WHERE "notifications"."user_id" = $1 AND (notifications.workflow_state = 'new')
---
                %h2
                  %strong= @user.notifications.active.count

SELECT COUNT(*) FROM "favorite_schools"  WHERE "favorite_schools"."player_id" = $1
---
                %h2
                  %strong= @user.favorite_schools.count

SELECT "favorite_schools".* FROM "favorite_schools"  WHERE "favorite_schools"."player_id" = $1
---
              %tbody
                - @user.favorite_schools.each do |favorite|

SELECT  "schools".* FROM "schools"  WHERE "schools"."id" = $1 LIMIT 1
SELECT COUNT(*) FROM "favorite_schools"  WHERE "favorite_schools"."school_id" = $1
---
                    %td= favorite.school.name
                    %td= favorite.school.favorite_schools.count
    .col-md-2

SELECT "notifications".* FROM "notifications"  WHERE "notifications"."user_id" = $1 AND (notifications.workflow_state = 'new')
SELECT  1 AS one FROM "notifications"  WHERE "notifications"."user_id" = $1 LIMIT 1
---
      %div.modal-body
        - if @user.notifications.empty?