app/views/users/index.html.haml

SELECT "positions".* FROM "positions" INNER JOIN "players_positions" ON "positions"."id" = "players_positions"."position_id" WHERE "players_positions"."player_id" = $1
---
              %td
                - player.positions.each do |pos|