app/views/position_needs/_form.html.haml

  What positions do you need to fill, coach?
  = select_tag "position_needs[]", options_from_collection_for_select(Position.all.collect, "id", "name"), multiple: true, class: "form-control"
---
SELECT "positions".* FROM "positions"