app/views/schools/show.html.haml

SELECT COUNT(*) FROM "favorite_schools"  WHERE "favorite_schools"."school_id" = $1
---
                %h2
                  %strong= @school.favorite_schools.count