app/controllers/favorite_schools_controller.rb

SELECT  "schools".* FROM "schools"  WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "favorite_schools".* FROM "favorite_schools"  WHERE "favorite_schools"."player_id" = $1 AND "favorite_schools"."school_id" = 9  [["player_id", 1]]
SELECT "favorite_schools".* FROM "favorite_schools"  WHERE "favorite_schools"."player_id" = $1 AND "favorite_schools"."school_id" = 8
INSERT INTO "favorite_schools" ("player_id", "school_id") VALUES ($1, $2) RETURNING "id"
---
  def create
    player = Player.find(params[:favorite_school][:player_id])
    if !player.favorite_schools.where(school_id: params[:favorite_school][:school_id]).present?
      @favorite_school = FavoriteSchool.new(favorite_school_params)
      if @favorite_school.save