app/controllers/position_needs_controller.rb

  def create
    needs = params[:position_needs]
    coach_id = params[:position_need][:coach_id]
    coach = Coach.find(coach_id)
    needs.each do |need|
      if !coach.position_needs.where(position_id: need.to_i).present?
        PositionNeed.create(position_id: need, coach_id: coach_id)
---
SELECT  "positions".* FROM "positions"  WHERE "positions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "position_needs".* FROM "position_needs"  WHERE "position_needs"."coach_id" = $1 AND "position_needs"."position_id" = 1  [["coach_id", 2]]
INSERT INTO "position_needs" ("coach_id", "created_at", "position_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def destroy
    @position_need = PositionNeed.find(params[:id])
    if @position_need.destroy
---
SELECT  "position_needs".* FROM "position_needs"  WHERE "position_needs"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "position_needs" WHERE "position_needs"."id" = $1  [["id", 6]]