app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    @schools = School.all

SELECT  "schools".* FROM "schools"  WHERE "schools"."id" = $1 LIMIT 1
---
  def set_school
    @school = School.find(params[:id])