app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
      if params[:positions]
        @user.update_positions(params[:positions])
      elsif params[:school]
        CoachingPosition.create school_id: params[:school].to_i, coach_id: @user.id
---
INSERT INTO "users" ("avatar", "created_at", "email", "first_name", "last_name", "password_digest", "type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "coaching_positions" ("coach_id", "school_id") VALUES ($1, $2) RETURNING "id"

  def set_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."type" IN ('Player') AND "users"."id" = $1 LIMIT 1  [["id", 1]]