app/models/notification.rb

SELECT "notifications".* FROM "notifications"  WHERE "notifications"."user_id" = $1 AND (notifications.workflow_state = 'new')
---
  def self.mark_reviewed(type, notifieable_id, current_user_id)
    @user = User.find(current_user_id)
    @notes = @user.notifications.active
    @notes.each do |note|