app/views/layouts/application.html.haml

                  Notifications
                  %span.badge= current_user.notifications.with_new_state.count
---
SELECT COUNT(*) FROM "notifications"  WHERE "notifications"."user_id" = $1 AND (notifications.workflow_state = 'new')